app/Answer.php

    public static function boot(){

        parent::boot();

        static::created(function($answer){
            $answer->question->increment('answers_count');
        });

        static::deleted(function($answer){
            $answer->question->decrement('answers_count');
        });
---
update `questions` set `answers_count` = `answers_count` + 1, `questions`.`updated_at` = '2020-07-21 09:42:00' where `id` = 5
update `questions` set `answers_count` = `answers_count` + 1, `questions`.`updated_at` = '2020-07-21 18:16:56' where `id` = 11
update `questions` set `answers_count` = `answers_count` - 1, `questions`.`updated_at` = '2020-07-20 00:03:39' where `id` = 1