app/Question.php

update `questions` set `best_answer_id` = 5, `questions`.`updated_at` = '2020-07-19 22:58:30' where `id` = 1
---
    public function acceptBestAnswer(Answer $answer){
        $this->best_answer_id = $answer->id;
        $this->save();