app/User.php

update `votables` set `vote` = -1 where `user_id` = 4 and `votable_type` = 'App\Question' and `votable_id` in (2)
insert into `votables` (`user_id`, `votable_id`, `votable_type`, `vote`) values (4, 9, 'App\Question', 1)
update `questions` set `votes_count` = -1, `questions`.`updated_at` = '2020-07-21 16:27:28' where `id` = 2
---
    public function voteQuestion(Question $question, $vote){
            $voteQuestions = $this->voteQuestions();
            if($voteQuestions->where('votable_id',$question->id)->exists()){
                $voteQuestions->updateExistingPivot($question,['vote'=>$vote]);
            }else{
                $voteQuestions->attach($question, ['vote'=>$vote]);
            }

            $question->load('votes');
            $downVotes = (int) $question->downVotes()->sum('vote');
            $upVotes = (int) $question->upVotes()->sum('vote');
            $question->votes_count = $upVotes + $downVotes;
            $question->save();

update `answers` set `votes_count` = -2, `answers`.`updated_at` = '2020-07-21 18:27:35' where `id` = 33
update `votables` set `vote` = 1 where `user_id` = 4 and `votable_type` = 'App\Answer' and `votable_id` in (11)
insert into `votables` (`user_id`, `votable_id`, `votable_type`, `vote`) values (4, 12, 'App\Answer', 1)
update `answers` set `votes_count` = 1, `answers`.`updated_at` = '2020-07-21 17:32:13' where `id` = 12
---
    public function voteAnswer(Answer $answer, $vote){
        $voteAnswers = $this->voteAnswers();
        if($voteAnswers->where('votable_id',$answer->id)->exists()){
            $voteAnswers->updateExistingPivot($answer,['vote'=>$vote]);
        }else{
            $voteAnswers->attach($answer, ['vote'=>$vote]);
        }

        $answer->load('votes');
        $downVotes = (int) $answer->downVotes()->sum('vote');
        $upVotes = (int) $answer->upVotes()->sum('vote');
        $answer->votes_count = $upVotes + $downVotes;
        $answer->save();