app/Http/Controllers/AnswersController.php

delete from `answers` where `id` = 42
---
    public function destroy(Question $question, Answer $answer)
    {
        $this->authorize('delete',$answer);
        $answer->delete();