app/Http/Controllers/FavoritesController.php

    public function store(Question $question){
        $question->favorites()->attach(auth()->id());
---
insert into `favorites` (`created_at`, `question_id`, `updated_at`, `user_id`) values ('2020-10-27 19:29:36', 9, '2020-10-27 19:29:36', 4)