app/Http/Controllers/QuestionsController.php

    public function index()
    {
        $questions = Question::with('user')->latest()->paginate(5);
---
select * from `questions` order by `created_at` desc limit 5 offset 0
select * from `users` where `users`.`id` in (1, 4)
select count(*) as aggregate from `questions`

    public function show(Question $question)
    {
        $question->increment('views');
---
update `questions` set `views` = `views` + 1, `questions`.`updated_at` = '2020-07-21 16:28:13' where `id` = 9