app/Providers/RouteServiceProvider.php

select * from `answers` where `answers`.`question_id` in (9)
select * from `users` where `users`.`id` in (3)
select * from `questions` where `slug` = 'ex-temporibus-vel-culpa-iure' limit 1
select * from `users` where `users`.`id` in (1, 3)
---
    public function boot()
    {
        Route::bind('slug', function($slug){
            /*return Question::with(['answers.user', 'answers'=>function($query){
                    $query->orderBy('votes_count','DESC');}
                ])->where('slug', $slug)->first() ?? abort(404);
        });*/

            return Question::with('answers.user')->where('slug', $slug)->first() ?? abort(404);